app/views/reputation/profile.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---

  Points: <% if User.find_by_id(cookies[:user_id]).points == nil %>0