app/controllers/busstops_controller.rb

    queryOBA(agencyid, stopid)

    # Get the comment
    if (Comment.find_by_agency_id_and_stop_id(agencyid, stopid) == nil)
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`agency_id` = '1' AND `comments`.`stop_id` = '75403' LIMIT 1