app/controllers/reputation_controller.rb

  def profile
    user = User.find_by_id(cookies[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1