app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'caitlinbonnar@gmail.com' LIMIT 1
SELECT `authorizations`.* FROM `authorizations` WHERE `authorizations`.`uid` = '114067822739773636460' LIMIT 1
INSERT INTO `authorizations` (`created_at`, `provider`, `uid`, `updated_at`, `user_id`) VALUES ('2014-07-01 19:26:57', 'google_oauth2', '114067822739773636460', '2014-07-01 19:26:57', 3)
INSERT INTO `users` (`accuracy`, `created_at`, `email`, `name`, `points`, `stops`, `updated_at`) VALUES (NULL, '2014-07-01 19:26:57', 'caitlinbonnar@gmail.com', 'Caitlin Bonnar', NULL, NULL, '2014-07-01 19:26:57')
---
  def create
    if cookies[:user_email]
      render :text => "You are already logged in."
      redirect_to dataview_url(:id => session[:agency_id]+"_"+session[:stop_id])
    else
      # Go get the authorization
      auth_hash = request.env['omniauth.auth']

      # Create the session
      cookies[:user_email] = {:value => auth_hash["info"]["email"], :expires => 1.month.from_now}

      # Check for existing credentials
      currentUser = User.find_by_email(cookies[:user_email])
      currentAuth = Authorization.find_by_uid(auth_hash["uid"])

      if (currentAuth == nil)
        if (currentUser != nil)
          currentAuth = Authorization.create(uid: auth_hash["uid"], provider: auth_hash["provider"], user_id: currentUser.id)